[
  {
    "avatar": "Pini.png",
    "name": "Pini Ben-Or",
    "title": "Chief Science Officer",
    "text": "I have worked with Deb for over ten years, starting at Actimize and then at Aktana. Working with Deb has always been a great pleasure, for many reasons that go beyond simple working relationships, but surely helped by his deep and diverse technical and business skills. In our years of working together Deb played crucial roles in working with me on multiple great decision engins, in financial crime detection and prevention and in multi-channel marketing, in both areas helping bring modern AI technology into advanced solutions to these complex business challenges. Deb is a paragon of what the term 'Senior Data Scientist' means - or should mean. Beyond having deep understanding and mastery of all key ML algorithms, of data engineering and business intelligence, if AI-engineering, and very importantly of Optimization - Deb possesses the much rarer quality of curiosity about the business context of the problem he deals with. The understanding of the broad business arena in which we opeate when we are trying to solve a problem, starting with how business processes generate that data we see, and of course the understanding of the business goals, objectives, of evaluation metrics and critical success factors - these are the apttitudes and skills that distinquish the vast majority of AI practitioners from the best and brightest. And if that's not enough to recommend him I am happy to add my observations of Deb's attitudes - I doubt I have known even a handful of people so honest, open-minded, cool-under-pressure, cooperative, and flexible as Deb. Working with Deb has been an important highlight of my life in these years, and not only my work-life. As AI technology evolves, and at the speed with which it does, Deb's enourmous curiosity and ability to learn fast and adapt will ensure his success.",
    "link": "https://www.linkedin.com/in/pini-ben-or-b721b76/"
  },
  {
    "avatar": "Danny.png",
    "name": "Danny Butvinik",
    "title": "Chief Data Scientist",
    "text": "I'm delighted to recommend Debabrata Pati, with whom I collaborated closely while he was part of an AML research data science team at NICE Actimize. Deb is a truly exceptional data scientist, blending significant experience with remarkable creativity and a profound understanding of complex data challenges. His ability to grasp intricate details and simultaneously envision the broader implications for models, systems, and product development makes him a valuable asset. Beyond his technical skills, Deb is a highly collaborative and pleasant individual, consistently fostering a positive environment and inspiring higher standards within our research efforts. Any organization seeking a top-tier, impactful data scientist would be fortunate to have Deb on their team.",
    "link": "https://www.linkedin.com/in/danny-butvinik/"
  },
  {
    "avatar": "Amar.png",
    "name": "Amar",
    "title": "Principal Data Scientist",
    "text": "I had the privilege of working with Debabrata during our time at NICE Actimize, where I observed his strong technical capabilities and collaborative approach.Debabrata brings solid expertise in AI and machine learning and demonstrates a clear understanding of how to align technical solutions with business objectives. He focuses on delivering practical outcomes and communicates complex ideas in a way that makes cross-functional collaboration effective.I particularly appreciated his openness to feedback and willingness to explore new approaches. Debabrata consistently contributed innovative ideas and showed adaptability in dynamic environments, which added value to the team’s overall goals.Any organization looking for a data scientist who combines technical depth with a strategic mindset would find Debabrata to be a strong asset.",
    "link": "https://www.linkedin.com/in/amar03/"
  },
  {
    "avatar": "simon.png",
    "name": "Simon Robins",
    "title": "Machine Learning Architect, Fintech, Product",
    "text": "I've had the privilege to work with Deb across two organizations. He can always be relied upon to deliver results and offer value to the business that is both cutting edge and explainable. A top data scientist, machine learning expert, and a gentleman.",
    "link": "https://www.linkedin.com/in/simon-robins-ml/"
  },
  {
    "avatar": "Diana.png",
    "name": "Diana",
    "title": "Senior Data Scientist",
    "text": "I’ve had the pleasure of working with Deb for many years across two companies, in two distinct domains - financial and pharmaceutical. It’s been an outstanding experience every time. Deb is one of those who combines deep technical expertise with creativity, clear thinking, and a truly collaborative spirit.We worked together on AI-driven projects, including comprehensive DRL/LLM pipelines, Agentic AI solutions, and other advanced initiatives. Despite often working from different time zones, our communication was always smooth, quick, and effective. Deb’s ability to understand complex problems, propose practical solutions, and support the team makes him an invaluable partner in any data science initiative.He’s dynamic, insightful, and always ready to help others reach common goals. I’ve learned a lot from our collaboration, and I would be glad to work with him again anytime.",
    "link": "https://www.linkedin.com/in/diana-schneider-53b24733/"
  },
  {
    "avatar": "vikram.png",
    "name": "Vikram Kamthe",
    "title": "Head of India Operations | Director of Engineering and Data Science",
    "text": "I had the opportunity to work with Debabrata Pati at both NICE Actimize and Aktana, where he consistently proved himself to be a highly capable and results-driven professional. Across both organizations, Debabrata stood out for his ability to navigate complex technical challenges while maintaining a clear focus on business impact.At NICE Actimize, he played a key role in solving high-value analytical problems in a fast-paced environment, bringing both clarity and innovation to technically demanding use cases. At Aktana, he further demonstrated his strength in aligning data science initiatives with strategic business priorities, consistently delivering solutions that drove measurable outcomes.What sets Debabrata apart is not just his technical depth in AI and data science, but his ability to think creatively, propose novel approaches, and inspire those around him. He consistently brought forward ideas that improved our offerings and challenged the team to aim higher.Debabrata's contributions left a lasting mark on both organizations. I highly recommend him as an AI and data science expert who combines technical excellence with strategic thinking and true business insight.",
    "link": "https://www.linkedin.com/in/vikram-kamthe/"
  },
  {
    "avatar": "sam.png",
    "name": "Sam McClain",
    "title": "Tech Product Architect",
    "text": "At Aktana, I worked alongside Deb during my time as a Product Manager for ML products. Deb was a Senior Data Scientist responsible for building and improving many of the advanced machine learning features that eventually became core to our customer offerings.Deb is absolutely brilliant and one of the most consistently hardworking colleagues I’ve ever come across, but what I appreciated most was his generosity.Generous with his time and generous with his knowledge, Deb always went out of his way to bring me along. He made sure I understood things at a technical level so we could make the right decisions for our customers. Need something last minute? Deb’s got you. Need to spend 30 minutes walking through how the code works to understand an edge case? Deb’s got you. Whatever I or the team needed, Deb was always ready to help.I can’t speak highly enough of Deb, he’s a tremendous asset to any team and a genuinely great teammate & human being.",
    "link": "https://www.linkedin.com/in/sam-mcclain-4b75081b2/"
  }
]